# If text_len > 1000

input_text = """Скажите знакомо ли вам такое явление как спам? Знаете что это такое? Согласен, странно звучит из моих 
уст. Каждый цивилизованный человек ежедневно сталкивается со спам звонками, спам сообщениями в соцсетях, спам рассылкой 
на электронную почту и так далее. Но что, если я вам скажу, что у вас есть собственный генератор спама, который 
находится у вас прямо в голове? Меня зовут Игорь Семениченко. Я практикующий дипломированный психолог и работаю в 
основном в рамках когнитивно-поведенческой, метакогнитивной и схема терапии. Так вот основоположник метакогнитивной 
терапии Адриан Уэллс как-то раз заметил, что всем здоровым людям приходит в голову множество мыслей, в том числе 
негативных. По некоторым подсчётам от двух-трёх тысяч мыслей в сутки. Некоторые из них произвольные. Вот что заметил 
Эдриан Уэлс, что одних людей эти мысли приводят к депрессивному расстройству, к тревожному расстройству, и к прочим 
неприятным состояниям нездоровым. А кого-то не приводят. Как вы думаете почему? Можете написать свой вариант в 
комментариях, а я пока попробую предложить свой вариант. Ну точнее не свой, а вариант, который предлагает 
метакогнитивная терапия. Давайте представим, что вот вам очень много в день приходит спам сообщений, спам рассылки на 
электронную почту, спам звонки поступают. Когда Вы заходите в Интернет, появляется какая-нибудь реклама с кем-то. 
Кто-то что-то там рекламирует вам. На любом сайте сбоку находятся вот такие вот разные рекламки. Некоторые прям на весь 
экран. Когда вы идёте в торговый центр, вам что-то предлагают понюхать, попробовать и так далее и тому подобное. И вот 
смотрите, какой пласт информации проходит сквозь вашу голову. Разве вы помните, что тут было вчера, когда вы смотрели 
свой любимый фильм? Ну, вот этого, может бы, человека, запомнили. Оно, правда, бывает, раздражает, но помните ли вот 
эту рекламу? Помните ли Вы, что вам предложили понюхать или что было на листовке в торговом центре? В конце концов, 
помните ли кто вам неделю назад звонил из банка? Помните из какого? Что предлагал? В каком размере взять выгодный
кредит? Я думаю не помните. По аналогии, какие Вам негативные мысли приходили в голову вчера или позавчера? Напомню, их
было где-то 2000 за 2 дня. Я вот, максимум, где-то пять припомню. Попробуйте, если хотите, написать в комментариях эти 
негативные мысли. Мы потом с ними поработаем. Смотрите это есть здоровое отношение. Да кто-то подошёл. Я посмотрел о 
чём-то, подумал. Ну, как говорится, будете проходить мимо, проходите мимо. Вот это выражение очень хорошо символизирует 
это отношение. Но когда происходят проблемы, я сейчас объясню, у вас появляются некие мысли. Допустим, завтра у меня 
совещание важное, или там какие-то проблемы со здоровьем, или, допустим, что, может быть, я никогда не найду свою 
любовь и буду в одиночестве, и таких много мыслей. Вот если пришла такая мысль, в целом в спортзале позанимался, сходил 
к врачу, всё в порядке. Когда возникают трудности, когда человек начинает думать о том, что вот меня напрягает, как-то 
иногда сердце быстро что ли стучит или медленно, не пойму, что-то не то. Загуглю-ка я. Господи, а что там пишут про 
сердечно-сосудистые заболевания. А давайте посмотрим ещё, вообще, какой топ смертельных болезней в России? А в мире? От 
чего люди умирают? Что-то там с сердцем? Наверняка потом загляну в медицинский словарь, посмотрю на симптоматику и так 
далее. А ещё лучше не буду ходить по лестнице, ездить буду на лифте и так далее. Позвольте мне такую метафору, это 
происходит такое метастазирование, и если не пользоваться каким-то таким специализированным языком, вы делаете из мухи 
слона, вот такого слона в вашей голове. И ладно если один слон у вас в голове, но если у вас таких слонов будет 4? 
Представьте, как в вашей голове, когда у вас таких слонов 5-10 штук? Даже три-четыре уже тяжело. И именно такие слоны, 
извиняюсь, такой простой язык, но чтобы было понятнее, приводят к тем проблемам, которые я озвучил в начале видео. 
Согласитесь, было бы странно, если бы вам сказали, что мне, вот, звонил неделю назад, предлагал кредит человек, я ему 
ответил: "Слушай, давай, тебе сейчас расскажу, почему я не хочу этот кредит, почему он мне не подходит?". И он 
объясняет, этот человек. За 2-3 часа перед сном, понимает, что не успел объяснить. Кладёт трубку, ложится спать. Утром 
звонит сам этому человеку и говорит: "Слушай, да, мне не нужен этот, кредит. Можешь мне больше не звонить?". И опять 
начинает всё объяснять. Согласитесь, это звучит абсурдно. Но именно так поступают люди с мыслями. Они начинают с ними 
спорить, искать аргументы за, против. Что-то там ещё с ними делать часами, неделями, месяцами. Это и есть слон. Я вам 
предложу в конце видео такое упражнение, немножко его сделаю более узким, простым. То есть представьте, у вас есть 
телефон, я буду использовать пульт. То есть, когда вам звонит какой-то спам, вы можете взять, увидеть, что там спам. 
Сейчас, обычно, пишут сразу, если вы взяли трубку, можете услышать, что это спам и вот так вот положить трубку. Почему
положить? Потому что сбросить вызов нельзя с мыслями, потому что мысли, когда мы их пытаемся как-то выключить, так не 
получится. Я в каком-то из видео об этом расскажу, но можно что сделать? Посмотреть на этот, звонок посмотреть на этот 
вызов, понять, что там есть спам и ничего с ним не делать, отложить. Он сам сбросится. Вот, он сбросился. Всё, он меня 
больше не тревожит. Именно так мы поступаем с спамом. Со спамом, но с мыслями предлагаю вам делать так же. Более того, 
можете сами сегодня вечером, днём, не знаю, в какое время вы смотрите это видео, самостоятельно вызвать какую-то мысль. 
Какую-то негативную, не слишком серьёзную, прошу вас. Ну, может быть, что-то тревожит. Ну, допустим, сейчас вот я стою 
в лесу, на меня выбежал медведь, или там, возможно, у меня будет свидание, которого пока нет, и у меня оно не удастся, 
и посмотрите, что происходит с вашими мыслями, своими мышцами, они могут как-то напрячься и так далее. Посмотрите, как
именно мысли приводят к зарождению определённых состояний. За созданием из мухи слона. Если умвас возникнут трудности 
какие-то, вопросы по поводу этого материала, пишите в комментариях. Я с удовольствием в будущих видео отвечу на ваши 
вопросы, или прямо в комментариях отвечу. Подписывайтесь на канал меднаука. А я прощаюсь с вами до будущих видео на 
этом канале, до свидания."""

text_len = len(input_text)
text_parts_num = int(text_len / 1000) + 1
parts_list = []

i = 1000
while i != 0:
    if input_text[i] in 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ':
        break
    i -= 1

result_text = input_text[:i - 1]
